/*ПРОВЕРКА ЗНАЧЕНИЙ
ЧИСЛА

ЧЕТНОЕ \ НЕЧЕТНОЕ \ ДЕЛИТСЯ НА N 
ЦЕЛОЕ:                     */ if( chislo %2 == 0 )   /*
НЕ ЦЕЛОЕ:                   */   if( chislo %2 != 0 ) /*
ДЕЛИТСЯ НА N      */ if( chislo %N == 0 )      /*  
НЕ ДЕЛИТСЯ НА N     */  if( chislo %N == 0 ) /*
АНАЛИЗ НА ОСТАТОК ЗНАЧЕНИЯ ПРИ ДЕЛЕНИИИ ( )*/
if( chislo %1== 0 )  // нет остатка
int ost=(chislo %1)*100;   // get 3 цыфры с остатка числа

/*ЧИСЛО ЗАКАНЧИВАЕТСЯ НА N (ПОСЛЕДНЯЯ ЦЫФРА)*/
 if( chislo %10== N )

/*НАХОЖДЕНИЕ СТЕПЕНЯ ЧИСЛА  ^N
   x ^  n  =  z   */

 


 
